Autodesk.Revit.UI.UIView.ZoomAndCenterRectangle(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Zoom and center the view to a specified rectangle.
viewCorner1:
A corner of the desired view rectangle in model coordinates.
viewCorner2:
The opposite corner of the desired view rectangle in model coordinates.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013